<?php
/**
 +--------------------------------------------
 * 默认配置文件
 * @author zhaohe
 * @time 2011.5.16
 +--------------------------------------------
 */

return array(

     /**
     +-----------------------------------
     * 系统变慢及语言设置
     +-----------------------------------
     */    
   //默认字符编码
    'charset'   => 'utf-8' ,
    //语言包
    'lang'      => 'zh_cn' ,
    
     /**
     +-----------------------------------
     * 数据库设置
     +-----------------------------------
     */    
    //数据库编码
    'db_charset'=> 'utf8' ,
    //数据源配置 数据库类型://用户名:密码@主机:端口/主数据库 
    'db_source' => array(
		'main'	=> 'mysql://test:test@localhost:3306/test1' ,
	),
    //数据库关系映射 映射名=>真实数据库名
    'db_map'    => array(
        //'main'=> 'true_db_name',
    ),
    
    /**
     +-----------------------------------
     * 缓存信息配置
     +-----------------------------------
     */    
    //支持file/memcache 
    'cache_type'=> 'memcache' ,
    //文件缓存时的目录层级
    'file_cache_level'  => 1 , 
    //使用memcache缓存时的主机配置
    'memcache_host'     => 'localhost' ,
    'memcache_port'     => 11211 ,
    

    /**
     +-----------------------------------
     * 路径模式
     +-----------------------------------
     */    
    //路径模式 rewrite/pathinfo/none
    'path_model'        => 'rewrite' ,
    
    
    /**
     +-----------------------------------
     * 运行时默认值设定
     +-----------------------------------
     */
    //默认控制器名
    'cotroller_default' => 'index' ,
    //默认方法名
    'action_default'    => 'main' ,
    //模板扩展名
    'template_ext'      => '.php' , 
    //静态资源路径
    'static_url'        => '/static' ,
    //是否启动Session
    'session_start'		=> true ,
    /**
    'session_handle'	=> 'cache' ,
    */
    //调试模式
    'debug_model'		=> true ,
    
    
    
    
    
    
    
    
    
    
    
);
